In [1]:
import pandas as pd
from pandas import Series, DataFrame

In [3]:
5+10

15

In [4]:
sr = Series([1,3,5])

In [6]:
sr + 30

0    31
1    33
2    35
dtype: int64

# 5-1. 산술연산
## 1) Series 산술연산
### - 같은 인덱스 라벨을 가진 항목끼리 산술 연산을 수행함.
### - 겹치는 인덱스가 없다면, 데이터는 NA가 된다. 
<img src="img/5강/산술연산.jpg" alt="산술연산표" style="width: 800px;"/>

In [7]:
sr1 = Series([1,2,3], index = list('abc'))
sr2 =  Series([4,5,6], index = list('abd'))

In [8]:
sr1 + sr2

a    5.0
b    7.0
c    NaN
d    NaN
dtype: float64

In [9]:
sr1.add(sr2)

a    5.0
b    7.0
c    NaN
d    NaN
dtype: float64

In [ ]:
#같은 인덱스 라벨을 가진 항목끼리 산술 연산을 수행함.
#겹치는 인덱스가 없다면, 데이터는 NA가 된다.

In [10]:
#sr1 + sr2와 동일하지만, 함수로 사용하는 경우에는 다양한 파라미터 설정이 가능해짐.
#sr1 + sr2
sr1.add(sr2)

a    5.0
b    7.0
c    NaN
d    NaN
dtype: float64

In [19]:
#산술 연산 시, 데이터가 없는 경우 fill_value인자의 값으로 간주함.
sr3 = Series([300, 500, 450], index = list('ABC'))
sr4 = Series([350, 450, 200], index = list('ABD'))

In [20]:
sr3

A    300
B    500
C    450
dtype: int64

In [21]:
sr4

A    350
B    450
D    200
dtype: int64

In [22]:
sr3 + sr4

A    650.0
B    950.0
C      NaN
D      NaN
dtype: float64

In [23]:
sr3.add(sr4, fill_value = 0)

A    650.0
B    950.0
C    450.0
D    200.0
dtype: float64

## 2) DataFrame 산술연산

In [24]:
arr1 = [[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]]
df1 = DataFrame(arr1, columns = list('bcd'), index = ['Ohio', 'Texas', 'Colorado'])
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [25]:
arr2 = [[ 0,  1,  2],
       [ 3,  4,  5],
       [ 6,  7,  8],
       [ 9, 10, 11]]
df2 = DataFrame(arr2, columns = list('bde'), index = ['Utah', 'Ohio', 'Texas', 'Oregon'])
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [26]:
# 컬럼과 로우 인덱스 모두 동일한 항목끼리 연산이 수행됨.
# 둘 중 하나라도 없으면 NaN 
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [28]:
df1.add(df2, fill_value = 0)
#fill_value = <값> : Missing Value를 <값>으로 간주함. 두 데이터프레임에 모두 없는 경우에는 결과도 Missing
# http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.add.html#pandas.DataFrame.add

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

## DataFrame 산술 연산
<img src="img/5강/데이터프레임add.jpg" alt="Add" style="width: 1000px;"/>

## 3) DataFrame과 Series 간의 연산

### 기본적으로 DataFrame과 Series 간의 산술연산은 Series의 색인을 DataFrame의 칼럼에 맞추고 아래로 전파한다.

In [29]:
df = DataFrame([[1,3, 5, 7],[2,4, 6, 8], [10, 20, 30, 40]], 
                          columns = list('ABCD'), index = ['X','Y','Z'])
df

    A   B   C   D
X   1   3   5   7
Y   2   4   6   8
Z  10  20  30  40

In [39]:
#A, B, C, D 컬럼 각각에 10, 20, 30, 40을 더하기
sr = Series([10, 20, 30, 40], index = ['A','B','C','D'])
sr

A    10
B    20
C    30
D    40
dtype: int64

In [40]:
df + sr
# axis 인자의 기본값이 1

    A   B   C   D
X  11  23  35  47
Y  12  24  36  48
Z  20  40  60  80

In [41]:
df.add(sr)  # default : axis = 1

    A   B   C   D
X  11  23  35  47
Y  12  24  36  48
Z  20  40  60  80

In [49]:
df.add(sr, axis = 0)  # df의 인덱스 레이블과 맞지않기 때문

    A   B   C   D
A NaN NaN NaN NaN
B NaN NaN NaN NaN
C NaN NaN NaN NaN
X NaN NaN NaN NaN
Y NaN NaN NaN NaN
Z NaN NaN NaN NaN

In [50]:
sr = Series([10, 20, 30], index = ['A','B','C'])

In [51]:
df.add(sr)

      A     B     C   D
X  11.0  23.0  35.0 NaN
Y  12.0  24.0  36.0 NaN
Z  20.0  40.0  60.0 NaN

In [57]:
df.add(sr, fill_value = 0)

NotImplementedError: fill_value 0 not supported.

In [53]:
#실습. X,Y,Z 로우에 각각에 10, 100, 1000을 더하시오.

In [54]:
sr2 = Series([10, 100, 1000], index = ['X','Y','Z'])

In [56]:
df.add(sr2, axis = 0)  # 열 단위로 덧셈 계산

      A     B     C     D
X    11    13    15    17
Y   102   104   106   108
Z  1010  1020  1030  1040

In [58]:
df

    A   B   C   D
X   1   3   5   7
Y   2   4   6   8
Z  10  20  30  40

In [59]:
df.max(axis = 1)

X     7
Y     8
Z    40
dtype: int64

In [61]:
df.max()   # axis = 0

A    10
B    20
C    30
D    40
dtype: int64

## 4) 함수 적용과 매핑

### apply() :각 로우나 컬럼의 1차원 배열에 함수를 적용
### applymap() : 각 항목에 함수를 적용

In [62]:
sr

A    10
B    20
C    30
dtype: int64

In [63]:
df

    A   B   C   D
X   1   3   5   7
Y   2   4   6   8
Z  10  20  30  40

#### 4-1) apply() 함수

In [80]:
# max(), min() -> 컬럼이나 1차원 배열에서의 최대 최소

def diff (x):
    return x.max() - x.min()

In [81]:
diff(sr)

20

In [82]:
diff(df)

A     9
B    17
C    25
D    33
dtype: int64

In [88]:
df.apply(diff, axis = 1)

X     6
Y     6
Z    30
dtype: int64

In [93]:
# lambda 함수 적용할 때에도 apply()를 사용함

df.apply(lambda X: X.max() - X.min(), axis = 1)

X     6
Y     6
Z    30
dtype: int64

#### 4-2) applymap() 함수

In [95]:
df.applymap(lambda a: a*2)

    A   B   C   D
X   2   6  10  14
Y   4   8  12  16
Z  20  40  60  80

In [94]:
def mul2(x):
    return x * 2

In [96]:
df.applymap(mul2)

    A   B   C   D
X   2   6  10  14
Y   4   8  12  16
Z  20  40  60  80

In [98]:
mul2(df)

    A   B   C   D
X   2   6  10  14
Y   4   8  12  16
Z  20  40  60  80

## 5. 컬럼 추가하기

In [99]:
df

    A   B   C   D
X   1   3   5   7
Y   2   4   6   8
Z  10  20  30  40

In [100]:
#'E' 컬럼을 추가하고 값을 10으로 할당
df['E'] = 10
df

    A   B   C   D   E
X   1   3   5   7  10
Y   2   4   6   8  10
Z  10  20  30  40  10

In [102]:
#'F' 컬럼을 추가하고, 값은 'B'와 'C' 컬럼의 값의 합을 추가
df['F'] = df.B + df.C
df

    A   B   C   D   E   F
X   1   3   5   7  10   8
Y   2   4   6   8  10  10
Z  10  20  30  40  10  50

In [107]:
# 실습. df에 'G'라는 새로운 컬럼을 추가하고, 
# 값은 각 로우(row)에 있는 값들 중 가장 작은 값으로 할당
df.min()
df.min(axis = 1)

df['G'] = df.min(axis =1)
df

    A   B   C   D   E   F   G
X   1   3   5   7  10   8   1
Y   2   4   6   8  10  10   2
Z  10  20  30  40  10  50  10

In [142]:
# 실습. df에 새로운 'H'라는 컬럼을 추가하고, 
# D의 값이 4의 배수이면 1, 아니면 0으로 할당
df['H'] = df.D % 4 == 0

df.apply(함수명, axis = 1)   -> apply, axis=1 : 컬럼 단위로

In [147]:
df['H']= df.apply(lambda row:
             1 if row.D%4==0
                 else 0, axis = 1)
df

    A   B   C   D   E   F   G  H
X   1   3   5   7  10   8   1  0
Y   2   4   6   8  10  10   2  1
Z  10  20  30  40  10  50  10  1

In [149]:
df['H']= df.apply(lambda x: 1 if x.D%4==0 else 0, axis = 1)

# 실습
## 실습을 위한 데이터 읽기 (NC Dinos.xlsx의 첫번째 시트값만 읽어오기)
## 첫번째 시트는 2013년도 선수 기록 정보
## NC 다이노스 선수들의 2013년 기록을 기준으로 안타와 홈런의 합이 100개 이상인 타자들만 아래 그림과 같이 출력
<img src="img/5강/NC안타홈런실습.jpg" alt='안타홈런실습' style="width: 250px;"/>

In [151]:
import pandas as pd

data = pd.read_excel('data/NC Dinos.xlsx', sheet_name = 0)
data.head(1)

,Unnamed: 0,선수명,팀명,경기,타석,타수,안타,홈런,득점,타점,볼넷,삼진,도루,BABIP,타율,출루율,장타율,OPS,wOBA,WAR
0,0,모창민,NC,108,436,395,109,12,57,51,37,68,16,0.307,0.276,0.339,0.443,0.782,0.353,2.31

In [152]:
data = data.set_index("선수명")[["안타", "홈런"]]

In [153]:
data["안타홈런"] = data.안타 + data.홈런

In [154]:
data[ data["안타홈런"] >= 100 ]

      안타  홈런  안타홈런
선수명
모창민  109  12   121
이호준  123  20   143
김종호  129   0   129
나성범   98  14   112
조영훈  107   6   113

In [156]:
NC13 = pd.read_excel('data/NC Dinos.xlsx')
NC13 = NC13[['선수명', '안타', '홈런']]
NC13['안타홈런'] = NC13.안타 + NC13.홈런
NC13 = NC13[NC13.안타홈런 >= 100]
NC13.set_index('선수명')

      안타  홈런  안타홈런
선수명
모창민  109  12   121
이호준  123  20   143
김종호  129   0   129
나성범   98  14   112
조영훈  107   6   113